data_generation/simulation_results/case_36/0/component_0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/component_0";;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * >

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    empty
    {
        type            empty;
    }
    "component_.*_to_pcb"
    {
        type            zeroGradient;
        value           uniform 0;
    }
    "component_.*_to_fluid"
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
