data_generation/simulation_results/case_36/constant/simParams
nIter 2000;
hComponent0 3540.5200097246916;
hComponent1 2552.3247929587455;
hComponent2 4471.565519296175;
hComponent3 4795.609684757694;
hComponent4 3228.5657729780933;kComponent0 96.51978911326233;
kComponent1 35.003054368358775;
kComponent2 13.148287238514747;
kComponent3 56.008430847999094;
kComponent4 18.906277387137145;
tAmbient 300;
Ux 1.3910178409214136;
kPCB 0.4598533736540933;