data_generation/simulation_results/case_36/system/component_0/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver          PCG;
        preconditioner  GAMG;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nonOrthogonalCorrector 20;
}

relaxationFactors
{

    fields
    {
	T	1;
    }

    equations
    {
               "(h|e).*"  0.7;
    }
}

// ************************************************************************* //
